export default class DataService{

    prices = [
        { name: "Балашихинский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2800 } 
        ] },
        { name: "Волоколамский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2800 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Воскресенский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Домодедовский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Дмитровский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2800 } 
        ] },
        { name: "Егорьевский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2800 } 
        ] },
        { name: "Зарайский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2550 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2800 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Истринский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2800 } 
        ] },
        { name: "Каширский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Клинский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Коломенский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Красногорский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Ленинский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Луховицкий", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2550 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2800 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Люберецкий", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Лотошинский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2550 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2800 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Мытищинский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2800 } 
        ] },
        { name: "Можайский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3100 } 
        ] },
        { name: "Наро-фоминский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Ногинский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Одинцовский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Озерский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Орехово-Зуевский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Павлово-Посадский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Подольский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Пушкинский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Раменский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Рузский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Сергиево-Посадский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2550 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2800 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3100 } 
        ] },
        { name: "Серебряно-Прудский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2750 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 3000 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3300 } 
        ] },
        { name: "Серпуховский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Солнечногорский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Ступинский", prices: [
            { type: "НПВХ", price: "-" },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Талдомский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2750 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 3000 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3200 } 
        ] },
        { name: "Химкинский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2450 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Чеховский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2250 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2500 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Шатурский", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2650 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2900 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3100 } 
        ] },
        { name: "Шаховской", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2550 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2800 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Щелковский", prices: [
            { type: "НПВХ", price: 2300 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2700 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 2900 } 
        ] },
        { name: "Калужская обл. Боровский район", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Калужская обл. Жуковский район", prices: [
            { type: "НПВХ", price: 2400 },
            { type: "Сталь 133 мм", price: 2350 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2600 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3000 } 
        ] },
        { name: "Тульская обл. Заокский район", prices: [
            { type: "НПВХ", price: "-" },
            { type: "Сталь 133 мм", price: 2550 },
            { type: "Сталь 133 мм + ПНД 117 мм", price: 2800 },
            { type: "Сталь 152 мм + ПНД 125 мм", price: 0 },
            { type: "Сталь 159 мм + ПНД 125 мм", price: 3100 } 
        ] }
    ]
    
    depths = [
        { name: "Балашихинский", depth: 68, min: 20, max: 150 },
        { name: "Волоколамский", depth: 63, min: 30, max: 150 },
        { name: "Воскресенский", depth: 65, min: 30, max: 150 },
        { name: "Домодедовский", depth: 48, min: 20, max: 150 },
        { name: "Дмитровский", depth: 152, min: 40, max: 250 },
        { name: "Егорьевский", depth: 65, min: 30, max: 150 },
        { name: "Зарайский", depth: 65, min: 20, max: 150 },
        { name: "Истринский", depth: 92, min: 40, max: 200 },
        { name: "Каширский", depth: 70, min: 20, max: 150 },
        { name: "Клинский", depth: 115, min: 40, max: 250 },
        { name: "Коломенский", depth: 47, min: 20, max: 150 },
        { name: "Красногорский", depth: 78, min: 30, max: 200 },
        { name: "Ленинский", depth: 71, min: 20, max: 180 },
        { name: "Луховицкий", depth: 60, min: 20, max: 150 },
        { name: "Люберецкий", depth: 51, min: 20, max: 180 },
        { name: "Лотошинский", depth: 60, min: 20, max: 150 },
        { name: "Мытищинский", depth: 78, min: 20, max: 180 },
        { name: "Можайский", depth: 60, min: 20, max: 150 },
        { name: "Наро-фоминский", depth: 60, min: 20, max: 150 },
        { name: "Ногинский", depth: 45, min: 20, max: 150 },
        { name: "Одинцовский", depth: 85, min: 20, max: 180 },
        { name: "Озерский", depth: 42, min: 20, max: 150 },
        { name: "Орехово-Зуевский", depth: 58, min: 20, max: 150 },
        { name: "Павлово-Посадский", depth: 42, min: 20, max: 150 },
        { name: "Подольский", depth: 48, min: 20, max: 150 },
        { name: "Пушкинский", depth: 90, min: 20, max: 200 },
        { name: "Раменский", depth: 65, min: 20, max: 150 },
        { name: "Рузский", depth: 62, min: 20, max: 180 },
        { name: "Сергиево-Посадский", depth: 160, min: 40, max: 250 },
        { name: "Серебряно-Прудский", depth: 65, min: 20, max: 150 },
        { name: "Серпуховский", depth: 55, min: 20, max: 150 },
        { name: "Солнечногорский", depth: 120, min: 30, max: 200 },
        { name: "Ступинский", depth: 44, min: 20, max: 150 },
        { name: "Талдомский", depth: 95, min: 20, max: 150 },
        { name: "Химкинский", depth: 72, min: 20, max: 150 },
        { name: "Чеховский", depth: 42, min: 20, max: 150 },
        { name: "Шатурский", depth: 78, min: 20, max: 150 },
        { name: "Шаховской", depth: 85, min: 20, max: 150 },
        { name: "Щелковский", depth: 61, min: 20, max: 150 },
        { name: "Калужская обл. Боровский район", depth: 55, min: 20, max: 150 },
        { name: "Калужская обл. Жуковский район", depth: 47, min: 20, max: 150 },
        { name: "Тульская обл. Заокский район", depth: 61, min: 20, max: 200 }
    ]

    /* Базовая цена при минимальной глубине в районе */

    installationPrices = {
        20: [
            { type: 'Эконом с адаптером', cost: 68250 },
            { type: 'Эконом с кессоном', cost: 92610 },
            { type: 'Стандарт с адаптером', cost: 74730 },
            { type: 'Стандарт с кессоном', cost: 108810 },
            { type: 'Премиум', cost: 143890 }
        ],
        30: [
            { type: 'Эконом с адаптером', cost: 69750 },
            { type: 'Эконом с кессоном', cost: 94110 },
            { type: 'Стандарт с адаптером', cost: 76230 },
            { type: 'Стандарт с кессоном', cost: 110310 },
            { type: 'Премиум', cost: 145390 }
        ],
        40: [
            { type: 'Эконом с адаптером', cost: 71250 },
            { type: 'Эконом с кессоном', cost: 95610 },
            { type: 'Стандарт с адаптером', cost: 77730 },
            { type: 'Стандарт с кессоном', cost: 111810 },
            { type: 'Премиум', cost: 146890 }
        ]
    }

    installations = this.depths.map(item => {
        const minDepth = item.min;
        const prices = this.installationPrices[minDepth]
        return {
            name: item.name,
            prices
        }
    })    

    getRegions = () => {
        return this.prices.map(item => item.name);
    }

    getDepth = (region) => {
        return this.depths.find(item => item.name === region);
    }

    getPrices = (region) => {
        return this.prices.find(item => item.name === region);
    }

    getInstallations = (region) => {
        return this.installations.find(item => item.name === region);
    }
}